
import { AcqSubjectDef } from "../types/acquisitions";

export const YEAR5_MATH_DEF: AcqSubjectDef = {
    id: 'math_y5',
    label: 'الرياضيات (السنة الخامسة)',
    competencies: [
        {
            id: 'control_numbers',
            label: 'التحكم في نظام العد والحساب',
            criteria: [
                { id: 1, label: 'مقارنة، ترتيب وحصر أعداد عشرية' },
                { id: 2, label: 'استعمال الكسور' },
                { id: 3, label: 'إنجاز العمليات الأربع' },
                { id: 4, label: 'التبليغ باللغة الرياضياتية' }
            ]
        },
        {
            id: 'geometry_space',
            label: 'التحكم في المصطلحات، وفي استعمال الأدوات الهندسية',
            criteria: [
                { id: 1, label: 'التمييز بين أشكال مألوفة وفق خواصها الهندسية، أو باستعمال أدوات هندسية' },
                { id: 2, label: 'رسم شكل هندسي انطلاقا من برنامج إنشاء أو نموذج' },
                { id: 3, label: 'التبليغ باللغة الرياضياتية' }
            ]
        },
        {
            id: 'measurements',
            label: 'التحكم في المقادير والقياس',
            criteria: [
                { id: 1, label: 'حساب محيطات، مساحات' },
                { id: 2, label: 'استعمال العلاقات بين مختلف وحدات القياس وحساب مدد' },
                { id: 3, label: 'التبليغ باللغة الرياضياتية' }
            ]
        },
        {
            id: 'data_org',
            label: 'تنظيم المعطيات',
            criteria: [
                { id: 1, label: 'استخراج، تنظيم، تمثيل معطيات واستغلالها' },
                { id: 2, label: 'استعمال خواص الخطية في وضعية تناسبية' },
                { id: 3, label: 'استعمال النسبة المئوية' },
                { id: 4, label: 'التبليغ باللغة الرياضياتية' }
            ]
        }
    ]
};
