
import { AcqSubjectDef } from "../types/acquisitions";

export const YEAR5_CIVICS_DEF: AcqSubjectDef = {
    id: 'civics_y5',
    label: 'التربية المدنية (السنة الخامسة)',
    competencies: [
        {
            id: 'coexistence',
            label: 'التعايش والتفاعل مع المحيط (الحياة الاجتماعية)',
            criteria: [
                { id: 1, label: 'إدراك دور أو وظائف المؤسسات الخدماتية' },
                { id: 2, label: 'استعمال ومعالجة مختلف الوثائق الإدارية' },
                { id: 3, label: 'البحث عن مصادر المعلومات واستغلالها' }
            ]
        },
        {
            id: 'citizenship',
            label: 'المشاركة في ترسيخ قيم المواطنة (الحياة المدنية)',
            criteria: [
                { id: 1, label: 'إبداء مواقف مسؤولة مع مختلف مظاهر المواطنة' },
                { id: 2, label: 'اقتراح حلول تجاه المشكلات التي تتعلق بالحقوق والواجبات' }
            ]
        },
        {
            id: 'democracy',
            label: 'ترقية الممارسات الديمقراطية واحترام المؤسسات',
            criteria: [
                { id: 1, label: 'التمييز بين الأساليب المختلفة في ممارسة الديمقراطية' },
                { id: 2, label: 'استيعاب مبادئ الديمقراطية واحترام مؤسسات الدولة' }
            ]
        }
    ]
};
