
import { AcqSubjectDef } from "../types/acquisitions";

export const YEAR5_ARABIC_DEF: AcqSubjectDef = {
    id: 'arabic_y5',
    label: 'اللغة العربية (السنة الخامسة)',
    competencies: [
        {
            id: 'oral_comms',
            label: 'فهم الخطاب والتواصل الشفوي',
            criteria: [
                { id: 1, label: 'الالتزام بآداب الاستماع والتحدث' },
                { id: 2, label: 'إدراك موضوع الخطاب وفكره الأساسية' },
                { id: 3, label: 'تدوين رؤوس الأقلام' },
                { id: 4, label: 'التجاوب مع التعليمات' },
                { id: 5, label: 'الاسترسال وسالمة لغة التواصل' },
                { id: 6, label: 'توظيف الدلالات اللفظية وغير اللفظية' }
            ]
        },
        {
            id: 'reading_perf',
            label: 'كفاءة الأداء القرائي',
            criteria: [
                { id: 1, label: 'قراءة وحدات لغوية كاملة قراءة مسترسلة' },
                { id: 2, label: 'قراءة معبرة عن المعاني' },
                { id: 3, label: 'احترام علامات الوقف وتمثلها' },
                { id: 4, label: 'احترام زمن الإنجاز (مدة القراءة)' }
            ]
        },
        {
            id: 'written_comp',
            label: 'كفاءة فهم المكتوب',
            criteria: [
                { id: 1, label: 'تحديد الفكرة العامة المعالجة في النص' },
                { id: 2, label: 'تحديد معلومات صريحة في النص أ' },
                { id: 3, label: 'تحديد معلومات صريحة في النص ب' },
                { id: 4, label: 'فهم العلاقات التركيبية والاستبدالية على فقرة أ' },
                { id: 5, label: 'فهم العلاقات التركيبية والاستبدالية على فقرة ب' },
                { id: 6, label: 'تفسير ظاهرة من النص أو تبيانها' },
                { id: 7, label: 'استخلاص فكرة ضمنية من النص' },
                { id: 8, label: 'اختيار مقطع وتبريره' }, 
                { id: 9, label: 'التعبير عن رأي أو عرض وجهة نظر' } 
            ]
        },
        {
            id: 'written_prod',
            label: 'كفاءة الإنتاج الكتابي',
            criteria: [
                { id: 1, label: 'احترام التعليمة والمهمات المرفقة' },
                { id: 2, label: 'وضوح التصميم وفق طبيعة المنتج' },
                { id: 3, label: 'تسلسل الأفكار وترابطها' },
                { id: 4, label: 'الالتزام بقواعد اللغة (النحوية، الصرفية واﻹملائية)' },
                { id: 5, label: 'الاستعمال السليم لعلامات الوقف' },
                { id: 6, label: 'إدراج قيمة، أو تحديد موقف، أو إبداء رأي' },
                { id: 7, label: 'جودة المنتج (تنظيم الورقة، احترام التباعد والمسافات...)' }
            ]
        }
    ]
};
